Repository: nashsibanda/microblog-miguelgrinberg-tutorial
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Please log in to access this page.
cy: Mewngofnodwch i gael mynediad i'r dudalen hon.

source: Username
cy: Enw defnyddiwr

source: Password
cy: Cyfrinair

source: Remember Me
cy: Cofiwch Fi

source: Sign In
cy: Mewngofnodi

source: Email
cy: E-bost

source: Confirm Password
cy: Cadarnhau cyfrinair

source: Register
cy: Cofrestru

source: Please use a different username
cy: Defnyddiwch enw defnyddiwr gwahanol

source: Please use a different email address
cy: Defnyddiwch gyfeiriad e-bost gwahanol

source: About Me
cy: Amdanaf Fi

source: Submit
cy: Cyflwyno

source: This username is already taken, please use a different one.
cy: Mae'r enw defnyddiwr hwn eisoes wedi'i gymryd, defnyddiwch un gwahanol.

source: Say something
cy: Dwed rhywbeth

source: Request Password Reset
cy: Gofyn am Ailosod Cyfrinair

source: Your post is now live!
cy: Mae eich swydd bellach yn fyw!

source: Home Page
cy: Tudalen Cartref

source: Explore
cy: Archwilio

source: Congratulations, you are now a registered user!
cy: Llongyfarchiadau, rydych chi bellach yn ddefnyddiwr cofrestredig!

source: Your changes have been saved!
cy: Mae eich newidiadau wedi'u cadw!

source: Edit Profile
cy: Golygu'r proffil

source: User %(username)s not found.
cy: Heb ganfod %(username)s defnyddiwr.

source: You cannot follow yourself!
cy: Allwch chi ddim dilyn eich hun!

source: You are following %(username)s!
cy: Rydych chi'n dilyn %(username)s!

source: You cannot unfollow yourself!
cy: Allwch chi ddim dad-ddilyn eich hun!

source: You are no longer following %(username)s.
cy: Dydych chi ddim yn dilyn %(username)s mwyach.

source: Check your email for the instructions to reset your password
cy: Gwiriwch eich e-bost am y cyfarwyddiadau i ailosod eich cyfrinair

source: Reset Password
cy: Ailosod Cyfrinair

source: Your password has been reset.
cy: Mae eich cyfrinair wedi'i ailosod.

source: Error: the translation service is not configured.
cy: Gwall: nid yw'r gwasanaeth cyfieithu wedi'i ffurfweddu.

source: Error: the translation service failed.
cy: Gwall: methodd y gwasanaeth cyfieithu.

source: File Not Found
cy: Heb Ganfod y Ffeil

source: Back
cy: Nôl

source: An unexpected error has occurred
cy: Mae gwall annisgwyl wedi digwydd

source: The administrator has been notified. Sorry for the inconvenience!
cy: Hysbyswyd y gweinyddwr. Mae'n ddrwg gennyf am yr anghyfleustra!

source: Welcome to Microblog!
cy: Croeso i Microblog!

source: Home
cy: Cartref

source: Login
cy: Mewngofnodi

source: Profile
cy: Proffil

source: Logout
cy: Logio Allan

source: Error: Could not contact server.
cy: Gwall: Doedd dim modd cysylltu â'r gweinydd.

source: Hello, %(username)s
cy: Helo, %(username)s

source: Newer posts
cy: Erthyglau newydd

source: Older posts
cy: Erthyglau hŷn

source: New User?
cy: Defnyddiwr Newydd?

source: Click to Register!
cy: Cliciwch i Gofrestru!

source: Click to reset your password
cy: Cliciwch i ailosod eich cyfrinair

source: Reset Your Password
cy: Ailosod eich Cyfrinair

source: User: %(username)s
cy: Defnyddiwr: %(username)s

source: Last seen on: %(when)s
cy: Gwelwyd ddiwethaf ar: %(when)s

source: %(followers)s followers, %(following)s following.
cy: %(followers)s dilynwyr, %(following)s canlynol.

source: Follow
cy: Dilyn

source: Unfollow
cy: Heb ei ddilyn

source: Edit your profile
cy: Golygu eich proffil
